Revit 2027 API
RebarConstraint.GetTargetHostFaceReference(Int32) Method
 Returns a reference that corresponds to the face to which the RebarConstraint is attached specified by the targetIndex. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover'.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Reference GetTargetHostFaceReference(
	int targetIndex
)
Public Function GetTargetHostFaceReference (
	targetIndex As Integer
) As Reference
public:
Reference^ GetTargetHostFaceReference(
	int targetIndex
)
member GetTargetHostFaceReference :
        targetIndex : int -> Reference
Parameters
targetIndex Int32
 The index of the target. Should be between 0 and NumberOfTargets().
Return Value
Reference
 Requested reference.
Exceptions
Exception | Condition
ArgumentException |  targetIndex is out of range.
InvalidOperationException |  RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'FixedDistanceToHostFace' or 'ToCover'.
See Also
Reference
RebarConstraint Class
GetTargetHostFaceReference Overload
Autodesk.Revit.DB.Structure Namespace